<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"86131ff267bb7d629cbdc23fbe379626fe54a1d5a0c1d8030a95e69a38f08fc1","plan_job_ref":"Job Plan Airflow DAGs #323 at https://github.com/cal-itp/data-infra/actions/runs/16328678599","plan_out_hash":"38e6c61e4a1fcb43d2ab7237dc65c3ac69b489d44903501fa91d7a97ef97c835","plan_hash":"6f040091888e6a4265b8445836f518af32faa7e2a4f44bbef9a378bd0cae69b0","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 17 to add, 23 to change, 5 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/cosmos_nonpayment_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/cosmos_nonpayment_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/cosmos_nonpayment_dag.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/cosmos_payment_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/cosmos_payment_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/cosmos_payment_dag.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/ntd_report_validation/external_table_all_ntdreports.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "JiH76w==" -> (known after apply)
!~      detect_md5hash      = "y+zH5zi1iBckCS9dcMXqwQ==" -> "different hash"
!~      generation          = 1752623512996143 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/ntd_report_validation/external_table_all_ntdreports.yml"
!~      md5hash             = "y+zH5zi1iBckCS9dcMXqwQ==" -> (known after apply)
        name                = "dags/create_external_tables/ntd_report_validation/external_table_all_ntdreports.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_all_dag.py"] will be destroyed
  # (because key ["dags/dbt_all_dag.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "uJ8Z3Q==" -> null
-       detect_md5hash      = "mDS0QrnOpntb04R+HA9/pA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752629644990909 -> null
-       id                  = "calitp-staging-composer-dags/dbt_all_dag.py" -> null
-       md5hash             = "mDS0QrnOpntb04R+HA9/pA==" -> null
-       md5hexhash          = "9834b442b9cea67b5bd3847e1c0f7fa4" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fdbt_all_dag.py?generation=1752629644990909&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/dbt_all_dag.py" -> null
-       output_name         = "dags/dbt_all_dag.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fdbt_all_dag.py" -> null
-       source              = "../../../../airflow/dags/dbt_all_dag.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_payments_dag.py"] will be destroyed
  # (because key ["dags/dbt_payments_dag.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "rGkeJQ==" -> null
-       detect_md5hash      = "7eXeFNXOFcei9euviktt+g==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752629644952655 -> null
-       id                  = "calitp-staging-composer-dags/dbt_payments_dag.py" -> null
-       md5hash             = "7eXeFNXOFcei9euviktt+g==" -> null
-       md5hexhash          = "ede5de14d5ce15c7a2f5ebaf8a4b6dfa" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fdbt_payments_dag.py?generation=1752629644952655&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/dbt_payments_dag.py" -> null
-       output_name         = "dags/dbt_payments_dag.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fdbt_payments_dag.py" -> null
-       source              = "../../../../airflow/dags/dbt_payments_dag.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/METADATA.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse/METADATA.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse/METADATA.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/README.md"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse/README.md"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse/README.md"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_test.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse/dbt_test.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse/dbt_test.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/METADATA.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh/METADATA.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh/METADATA.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/README.md"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh/README.md"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh/README.md"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh/dbt_test.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh/dbt_test.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/METADATA.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh_sunday/METADATA.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/METADATA.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/README.md"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh_sunday/README.md"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/README.md"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/transitland_hook.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/hooks/transitland_hook.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/hooks/transitland_hook.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/libs/__init__.py"] will be destroyed
  # (because key ["plugins/libs/__init__.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751950420136018 -> null
-       id                  = "calitp-staging-composer-plugins/libs/__init__.py" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       md5hexhash          = "d41d8cd98f00b204e9800998ecf8427e" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Flibs%2F__init__.py?generation=1751950420136018&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/libs/__init__.py" -> null
-       output_name         = "plugins/libs/__init__.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Flibs%2F__init__.py" -> null
-       source              = "../../../../airflow/plugins/libs/__init__.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/aggregator_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ig+/LA==" -> (known after apply)
!~      detect_md5hash      = "XJkgbCLPyivP+4iiIstZYw==" -> "different hash"
!~      generation          = 1752098038059693 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/aggregator_to_gcs_operator.py"
!~      md5hash             = "XJkgbCLPyivP+4iiIstZYw==" -> (known after apply)
        name                = "plugins/operators/aggregator_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "WRdFpA==" -> (known after apply)
!~      detect_md5hash      = "sXixJ7yd0a/nE3vZFh+ZxQ==" -> "different hash"
!~      generation          = 1752627600778857 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "sXixJ7yd0a/nE3vZFh+ZxQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/.DS_Store"] will be destroyed
  # (because key ["macros/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752622237777318 -> null
-       id                  = "calitp-staging-composer-data/warehouse/macros/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F.DS_Store?generation=1752622237777318&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/macros/.DS_Store" -> null
-       output_name         = "data/warehouse/macros/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F.DS_Store" -> null
-       source              = "../../../../warehouse/macros/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/generate_schema_name.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "1cISeg==" -> (known after apply)
!~      detect_md5hash      = "hmY4HAg3iAMoH3xyc2LT4w==" -> "different hash"
!~      generation          = 1752622237848261 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/generate_schema_name.sql"
!~      md5hash             = "hmY4HAg3iAMoH3xyc2LT4w==" -> (known after apply)
        name                = "data/warehouse/macros/generate_schema_name.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/_mart_gtfs_fcts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "rPb5Jg==" -> (known after apply)
!~      detect_md5hash      = "GnWm8+Klfap5+wxl4lGR2A==" -> "different hash"
!~      generation          = 1752627599362960 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/_mart_gtfs_fcts.yml"
!~      md5hash             = "GnWm8+Klfap5+wxl4lGR2A==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/_mart_gtfs_fcts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/transit_database/_mart_transit_database.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "b8nOEw==" -> (known after apply)
!~      detect_md5hash      = "6xSVbYLmRIFEpaQwPKZw7w==" -> "different hash"
!~      generation          = 1752627599326367 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
!~      md5hash             = "6xSVbYLmRIFEpaQwPKZw7w==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/_mart_transit_database.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "pnJRmA==" -> (known after apply)
!~      detect_md5hash      = "ME4V8bzaV2WX6rbxGkvVaA==" -> "different hash"
!~      generation          = 1752622236935518 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"
!~      md5hash             = "ME4V8bzaV2WX6rbxGkvVaA==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "VHLciA==" -> (known after apply)
!~      detect_md5hash      = "flAZRqxWJj+Ez7DioKBnXA==" -> "different hash"
!~      generation          = 1752622237818877 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"
!~      md5hash             = "flAZRqxWJj+Ez7DioKBnXA==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__master.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "tDDetg==" -> (known after apply)
!~      detect_md5hash      = "TsNwblh/7QT+RuQSEp2UVw==" -> "different hash"
!~      generation          = 1752622238293921 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__master.sql"
!~      md5hash             = "TsNwblh/7QT+RuQSEp2UVw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__master.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "e5FrIA==" -> (known after apply)
!~      detect_md5hash      = "QisdMhWhSrExFUd7MsDnrw==" -> "different hash"
!~      generation          = 1752622237623591 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"
!~      md5hash             = "QisdMhWhSrExFUd7MsDnrw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "OevwOA==" -> (known after apply)
!~      detect_md5hash      = "smrstDSDHVAfIcfQlawZ8g==" -> "different hash"
!~      generation          = 1752622237092298 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"
!~      md5hash             = "smrstDSDHVAfIcfQlawZ8g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "TsqDzg==" -> (known after apply)
!~      detect_md5hash      = "BUDkHW0CX2uqeql/JydDxQ==" -> "different hash"
!~      generation          = 1752622237816276 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"
!~      md5hash             = "BUDkHW0CX2uqeql/JydDxQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "U+Nxnw==" -> (known after apply)
!~      detect_md5hash      = "v6WWufiuw6I6nwJ8ea3/3g==" -> "different hash"
!~      generation          = 1752622237822342 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"
!~      md5hash             = "v6WWufiuw6I6nwJ8ea3/3g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "HeQdug==" -> (known after apply)
!~      detect_md5hash      = "anF7mdEw+HnZ7cF0lGMldQ==" -> "different hash"
!~      generation          = 1752622238111167 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"
!~      md5hash             = "anF7mdEw+HnZ7cF0lGMldQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "IkHt/A==" -> (known after apply)
!~      detect_md5hash      = "kOmymouK47O0fQVVSn5+8g==" -> "different hash"
!~      generation          = 1752622237805416 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"
!~      md5hash             = "kOmymouK47O0fQVVSn5+8g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/stg_ntd__complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_validation/stg_ntd_a10.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Lwul9A==" -> (known after apply)
!~      detect_md5hash      = "HVXbMYojXW+b9ZD21kJ+Fw==" -> "different hash"
!~      generation          = 1752627599307061 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_validation/stg_ntd_a10.sql"
!~      md5hash             = "HVXbMYojXW+b9ZD21kJ+Fw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_validation/stg_ntd_a10.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_validation/stg_ntd_a30_assetandresourceinfo.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "YqwsVg==" -> (known after apply)
!~      detect_md5hash      = "KatBbRWxFju09wbwujNsKw==" -> "different hash"
!~      generation          = 1752627599313391 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_validation/stg_ntd_a30_assetandresourceinfo.sql"
!~      md5hash             = "KatBbRWxFju09wbwujNsKw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_validation/stg_ntd_a30_assetandresourceinfo.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_validation/stg_ntd_rr20_rural.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "EQxEag==" -> (known after apply)
!~      detect_md5hash      = "buFh01cD+5Usw35piIhmdQ==" -> "different hash"
!~      generation          = 1752627599306166 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_validation/stg_ntd_rr20_rural.sql"
!~      md5hash             = "buFh01cD+5Usw35piIhmdQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_validation/stg_ntd_rr20_rural.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_validation/stg_ntd_rr20_urban_tribal.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "8jx52w==" -> (known after apply)
!~      detect_md5hash      = "iWUpXFIxK7RD0uKLE1+sXg==" -> "different hash"
!~      generation          = 1752627599198595 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_validation/stg_ntd_rr20_urban_tribal.sql"
!~      md5hash             = "iWUpXFIxK7RD0uKLE1+sXg==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_validation/stg_ntd_rr20_urban_tribal.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["packages.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "pC4lag==" -> (known after apply)
!~      detect_md5hash      = "7t4KOYrgyjZU01Wt+cn11w==" -> "different hash"
!~      generation          = 1752622236958409 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/packages.yml"
!~      md5hash             = "7t4KOYrgyjZU01Wt+cn11w==" -> (known after apply)
        name                = "data/warehouse/packages.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["tests/.DS_Store"] will be destroyed
  # (because key ["tests/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "s+mJiQ==" -> null
-       detect_md5hash      = "oKfMIt6AQAIL99uaN6y/2Q==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752622237417562 -> null
-       id                  = "calitp-staging-composer-data/warehouse/tests/.DS_Store" -> null
-       md5hash             = "oKfMIt6AQAIL99uaN6y/2Q==" -> null
-       md5hexhash          = "a0a7cc22de8040020bf7db9a37acbfd9" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftests%2F.DS_Store?generation=1752622237417562&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/tests/.DS_Store" -> null
-       output_name         = "data/warehouse/tests/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftests%2F.DS_Store" -> null
-       source              = "../../../../warehouse/tests/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-index will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-index" {
!~      content             = (sensitive value)
!~      crc32c              = "IpZIrQ==" -> (known after apply)
!~      detect_md5hash      = "UfZomGsHk2apMVHrXXaXuw==" -> "different hash"
!~      generation          = 1752627599721754 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/index.html"
!~      md5hash             = "UfZomGsHk2apMVHrXXaXuw==" -> (known after apply)
        name                = "data/warehouse/target/index.html"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "5ltfmg==" -> (known after apply)
!~      detect_md5hash      = "dMJIzgxhhvznYK3+LzYw9Q==" -> "different hash"
!~      generation          = 1752627602502369 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "dMJIzgxhhvznYK3+LzYw9Q==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "KLLQ5g==" -> (known after apply)
!~      detect_md5hash      = "VbpK1LXbULgS2hM9OUtXgA==" -> "different hash"
!~      generation          = 1752629646479639 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "VbpK1LXbULgS2hM9OUtXgA==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 17 to add, 23 to change, 5 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #323](https://github.com/cal-itp/data-infra/actions/runs/16328678599)